In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns 
from sklearn.metrics import confusion_matrix
from sklearn.neighbors import KNeighborsClassifier
from sklearn.preprocessing import StandardScaler

In [3]:
df=pd.read_csv('iphone_purchase_records.csv')

In [4]:
df.head()

   Gender  Age  Salary  Purchase Iphone
0    Male   19   19000                0
1    Male   35   20000                0
2  Female   26   43000                0
3  Female   27   57000                0
4    Male   19   76000                0

In [5]:
df.isnull().sum()

Gender             0
Age                0
Salary             0
Purchase Iphone    0
dtype: int64

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Gender           400 non-null    object
 1   Age              400 non-null    int64
 2   Salary           400 non-null    int64
 3   Purchase Iphone  400 non-null    int64
dtypes: int64(3), object(1)
memory usage: 12.6+ KB

In [7]:
df.describe()

              Age         Salary  Purchase Iphone
count  400.000000     400.000000       400.000000
mean    37.655000   69742.500000         0.357500
std     10.482877   34096.960282         0.479864
min     18.000000   15000.000000         0.000000
25%     29.750000   43000.000000         0.000000
50%     37.000000   70000.000000         0.000000
75%     46.000000   88000.000000         1.000000
max     60.000000  150000.000000         1.000000

In [11]:
df.columns= df.columns.str.replace(" ","")

In [13]:
s= df[df['Gender']=='Female']['PurchaseIphone'].value_counts().reset_index()
s

   index  PurchaseIphone
0      0             127
1      1              77

In [14]:
df.loc[df['PurchaseIphone']==1,'Gender'].value_counts()

Female    77
Male      66
Name: Gender, dtype: int64

In [15]:
x= df.iloc[:,:-1]
y= df.iloc[:,-1]

In [16]:
from sklearn.preprocessing import LabelEncoder

In [17]:
enc = LabelEncoder()

In [21]:
x.Gender = enc.fit_transform(x.Gender)

x

     Gender  Age  Salary
0         1   19   19000
1         1   35   20000
2         0   26   43000
3         0   27   57000
4         1   19   76000
..      ...  ...     ...
395       0   46   41000
396       1   51   23000
397       0   50   20000
398       1   36   33000
399       0   49   36000

[400 rows x 3 columns]

In [22]:
scale= StandardScaler()

In [23]:
x= scale.fit_transform(x)

In [24]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2)

In [25]:
knn= KNeighborsClassifier(n_neighbors=7)

In [26]:
knn.fit(x_train,y_train)

KNeighborsClassifier(algorithm='auto', leaf_size=30, metric='minkowski',
                     metric_params=None, n_jobs=None, n_neighbors=7, p=2,
                     weights='uniform')

In [28]:
y_pred=knn.predict(x_test)

In [29]:
confusion_matrix(y_test,y_pred)

array([[48,  2],
       [ 2, 28]])

In [30]:
accuracy=(48+21)/(48+2+2+28)
accuracy

0.8625

In [33]:
lis=[i for i in range(2,101) if i%2!=0]
lis

[3,
 5,
 7,
 9,
 11,
 13,
 15,
 17,
 19,
 21,
 23,
 25,
 27,
 29,
 31,
 33,
 35,
 37,
 39,
 41,
 43,
 45,
 47,
 49,
 51,
 53,
 55,
 57,
 59,
 61,
 63,
 65,
 67,
 69,
 71,
 73,
 75,
 77,
 79,
 81,
 83,
 85,
 87,
 89,
 91,
 93,
 95,
 97,
 99]

In [34]:
from sklearn.metrics import accuracy_score

dic ={}

for i in lis:
  knn= KNeighborsClassifier(n_neighbors=i)
  knn.fit(x_train,y_train)
  y_pred=knn.predict(x_test)
  acc = accuracy_score(y_test,y_pred)
  dic[i]=acc

In [35]:
dic

{3: 0.925,
 5: 0.95,
 7: 0.95,
 9: 0.9625,
 11: 0.95,
 13: 0.95,
 15: 0.95,
 17: 0.9375,
 19: 0.9375,
 21: 0.9375,
 23: 0.925,
 25: 0.925,
 27: 0.925,
 29: 0.9125,
 31: 0.8875,
 33: 0.9,
 35: 0.9,
 37: 0.875,
 39: 0.8625,
 41: 0.85,
 43: 0.8375,
 45: 0.8375,
 47: 0.8125,
 49: 0.825,
 51: 0.825,
 53: 0.825,
 55: 0.825,
 57: 0.8125,
 59: 0.8125,
 61: 0.8,
 63: 0.8,
 65: 0.8,
 67: 0.8,
 69: 0.775,
 71: 0.7625,
 73: 0.7875,
 75: 0.8,
 77: 0.7875,
 79: 0.775,
 81: 0.8,
 83: 0.7875,
 85: 0.8,
 87: 0.7625,
 89: 0.7875,
 91: 0.7875,
 93: 0.7625,
 95: 0.7625,
 97: 0.7625,
 99: 0.7375}